{"class_name": "Functional", "config": {"name": "model_180", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_180"}, "name": "input_180", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_849", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_849", "inbound_nodes": [[["input_180", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_670", "trainable": true, "dtype": "float32", "rate": 0.65, "noise_shape": null, "seed": null}, "name": "dropout_670", "inbound_nodes": [[["dense_849", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_850", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_850", "inbound_nodes": [[["dropout_670", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_671", "trainable": true, "dtype": "float32", "rate": 0.65, "noise_shape": null, "seed": null}, "name": "dropout_671", "inbound_nodes": [[["dense_850", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_851", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_851", "inbound_nodes": [[["dropout_671", 0, 0, {}]]]}], "input_layers": [["input_180", 0, 0]], "output_layers": [["dense_851", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}