{"class_name": "Functional", "config": {"name": "model_285", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_285"}, "name": "input_285", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_1144", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1144", "inbound_nodes": [[["input_285", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_860", "trainable": true, "dtype": "float32", "rate": 0.65, "noise_shape": null, "seed": null}, "name": "dropout_860", "inbound_nodes": [[["dense_1144", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1145", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1145", "inbound_nodes": [[["dropout_860", 0, 0, {}]]]}], "input_layers": [["input_285", 0, 0]], "output_layers": [["dense_1145", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}